Q1. You are given a dataset named employee_data with columns 'Name', 'Age', 'Salary', and 'Department'. How would you select and display the names of employees who are older than 30 and work in the 'Sales' department?

In [ ]:
# Sample Data
import pandas as pd

data = {'Name': ['Alice', 'Bob', 'Charlie'],
        'Age': [32, 28, 35],
        'Salary': [60000, 75000, 90000],
        'Department': ['Sales', 'IT', 'Sales']}

employee_data = pd.DataFrame(data)
employee_data

      Name  Age  Salary Department
0    Alice   32   60000      Sales
1      Bob   28   75000         IT
2  Charlie   35   90000      Sales

In [ ]:
employee_data[(employee_data.Age>30) & (employee_data.Department=='Sales')]

      Name  Age  Salary Department
0    Alice   32   60000      Sales
2  Charlie   35   90000      Sales

Q2. In a dataset named customer_data, there are missing values in the 'Income' column. How would you handle these missing values, and then create a new column 'Income_Category' that labels customers as 'Low', 'Medium', or 'High' income based on predefined thresholds?

In [ ]:
# Sample Data
import pandas as pd
import numpy as np

data = {'CustomerID': [1, 2, 3, 4],
        'Income': [50000, np.nan, 75000, np.nan]}
customer_data = pd.DataFrame(data)
customer_data

   CustomerID   Income
0           1  50000.0
1           2      NaN
2           3  75000.0
3           4      NaN

In [ ]:
customer_data.Income.fillna(customer_data.Income.mean(), inplace=True)

In [ ]:
customer_data

   CustomerID   Income
0           1  50000.0
1           2  62500.0
2           3  75000.0
3           4  62500.0

In [ ]:
def cust_class(income):
    if income<=50000:
        return 'Low'
    elif (income>50000) & (income<70000):
        return 'Medium'
    else:
        return 'High'

In [ ]:
customer_data['Income_Category']= customer_data.Income.apply(cust_class)

In [ ]:
customer_data

   CustomerID   Income Income_Category
0           1  50000.0             Low
1           2  62500.0          Medium
2           3  75000.0            High
3           4  62500.0          Medium

Q3. Consider a DataFrame named order_data with columns 'Customer', 'Product', and 'Quantity'. How would you find the total quantity of each product sold, and then identify the product with the highest total sales?

In [ ]:
# Sample Data
import pandas as pd

data = {'Customer': ['A', 'B', 'A', 'B', 'A'],
        'Product': ['X', 'Y', 'X', 'Y', 'Z'],
        'Quantity': [10, 5, 8, 12, 15]}
order_data = pd.DataFrame(data)
order_data

  Customer Product  Quantity
0        A       X        10
1        B       Y         5
2        A       X         8
3        B       Y        12
4        A       Z        15

In [ ]:
order_data.groupby('Product')['Quantity'].sum().idxmax()

'X'

Q4. You have two DataFrames, student_info with columns 'StudentID' and 'Name', and grades_info with columns 'StudentID' and 'Grade'. How would you merge these DataFrames to obtain a single DataFrame containing both student information and their grades?

In [ ]:
# Sample Data
import pandas as pd

student_info = pd.DataFrame({'StudentID': [1, 2, 3], 'Name': ['Alice', 'Bob', 'Charlie']})
grades_info = pd.DataFrame({'S_ID': [2, 3, 4], 'Grade': [85, 90, 78]})
grades_info

   S_ID  Grade
0     2     85
1     3     90
2     4     78

In [ ]:
pd.merge(student_info, grades_info, left_on ='StudentID', right_on='S_ID', how='outer')

   StudentID     Name  S_ID  Grade
0        1.0    Alice   NaN    NaN
1        2.0      Bob   2.0   85.0
2        3.0  Charlie   3.0   90.0
3        NaN      NaN   4.0   78.0

Q5. Suppose you have a DataFrame named temperature_data with columns 'Timestamp' and 'Temperature'. How would you filter the data to include only temperatures above 25 degrees Celsius and then sort the results by timestamp?

In [ ]:
# Sample Data
import pandas as pd

data = {'Timestamp': ['2023-01-01', '2023-01-02', '2023-01-03'],
        'Temperature': [28, 26, 30]}
temperature_data = pd.DataFrame(data)

temperature_data

    Timestamp  Temperature
0  2023-01-01           28
1  2023-01-02           26
2  2023-01-03           30

In [ ]:
temperature_data.dtypes

Timestamp      object
Temperature     int64
dtype: object

In [ ]:
temperature_data.Timestamp=pd.to_datetime(temperature_data.Timestamp, format='%Y-%m-%d')

In [ ]:
temperature_data[temperature_data.Temperature>26].sort_values(by=['Timestamp'])

   Timestamp  Temperature
0 2023-01-01           28
2 2023-01-03           30

Q6. Given a DataFrame sales_data with columns 'Product' and 'Revenue', how would you calculate the total revenue for each product and then create a new column 'Revenue_Percentage' representing the percentage of total revenue that each product contributes?

In [ ]:
# Sample Data
import pandas as pd

data = {'Product': ['A', 'B', 'C', 'A', 'B'],
        'Revenue': [1000, 1500, 800, 1200, 2000]}
sales_data = pd.DataFrame(data)

sales_data

  Product  Revenue
0       A     1000
1       B     1500
2       C      800
3       A     1200
4       B     2000

In [ ]:
total_sales = sales_data.groupby('Product')['Revenue'].sum()

In [ ]:
total_sales

Product
A    2200
B    3500
C     800
Name: Revenue, dtype: int64

In [ ]:
tatal_df = pd.DataFrame(total_sales)

In [ ]:
tatal_df.reset_index(inplace=True)

In [ ]:
sales_data['Per']= sales_data.Revenue/total_sales

In [ ]:
sales_data

  Product  Revenue  Per
0       A     1000  NaN
1       B     1500  NaN
2       C      800  NaN
3       A     1200  NaN
4       B     2000  NaN

In [ ]:
pd.merge(sales_data,total_sales, on='Product')

  Product  Revenue_x  Per  Revenue_y
0       A       1000  NaN       2200
1       A       1200  NaN       2200
2       B       1500  NaN       3500
3       B       2000  NaN       3500
4       C        800  NaN        800

Q7. You have a DataFrame named sensor_data with columns 'Timestamp', 'Sensor_A', and 'Sensor_B'. How would you calculate the average readings of both sensors for each day and identify the day with the highest combined average reading?

In [ ]:
# Sample Data
import pandas as pd

data = {'Timestamp': ['2023-01-01', '2023-01-01', '2023-01-02', '2023-01-02'],
        'Sensor_A': [20, 25, 18, 22],
        'Sensor_B': [15, 30, 20, 25]}
sensor_data = pd.DataFrame(data)
sensor_data

    Timestamp  Sensor_A  Sensor_B
0  2023-01-01        20        15
1  2023-01-01        25        30
2  2023-01-02        18        20
3  2023-01-02        22        25

In [ ]:
sensor_avg = sensor_data.groupby('Timestamp').mean()

In [ ]:
sensor_avg

            Sensor_A  Sensor_B
Timestamp
2023-01-01      22.5      22.5
2023-01-02      20.0      22.5

In [ ]:
sensor_avg.sum(axis=1).idxmax()

'2023-01-01'